app/controllers/donuts_controller.rb

  def index
    @donuts = Donut.all
---
SELECT "donuts".* FROM "donuts"

  def create
    @donut = Donut.new(donut_params)

    respond_to do |format|
      if @donut.save
---
INSERT INTO "donuts" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Small Steel Bag"], ["created_at", "2015-12-06 16:17:27.541619"], ["updated_at", "2015-12-06 16:17:27.541619"]]

  def update
    respond_to do |format|
      if @donut.update(donut_params)
---
UPDATE "donuts" SET "name" = ?, "ad_copy" = ?, "updated_at" = ? WHERE "donuts"."id" = ?  [["name", "chocolate"], ["ad_copy", "yum yum yum"], ["updated_at", "2015-12-06 21:05:36.640271"], ["id", 1]]

  def destroy
    @donut.destroy
---
DELETE FROM "donuts" WHERE "donuts"."id" = ?  [["id", 1]]

    def set_donut
      @donut = Donut.find(params[:id])
---
SELECT  "donuts".* FROM "donuts" WHERE "donuts"."id" = ? LIMIT 1  [["id", 1]]